package numprint;
//입력된 숫자만큼 행과 열이 연속되서 출력.
//-----------------------------------------//
/* 입력된 숫자크기의 행과 열이 만들어지고, 숫자는 점차 증가한다. 
 * 숫자의 증가는 세로로 증가한다. 
입력: 3
출력: 147
     258
     369*/
//-----------------------------------------//
public class vernumprint {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		int num = 3;
		int [][] array = new int[num][num];
		
		//출력하기 위한 배열 정리(방법 1.)
		//-----------------------------------------//
		int result=1;                   //초기값(1부터 시작하기 때문에) 지정.
		
		for(int i=0;i<num;i++) {        //원래는 행 ->  열로 사용
			for(int j=0;j<num;j++) {    //원래는 열 ->  행으로 사용
				array[j][i]=result;     //[0,0][1,0][2,0] 이기 때문에 아래로 하나 씩 증가한다.
				result++;
			}
		}
		//-----------------------------------------//
		
		
		//출력
		//-----------------------------------------//
		for(int i=0;i<num;i++) {
			for(int j=0;j<num;j++) {
				System.out.print(array[i][j]);
			}
			System.out.println();
		}
		//-----------------------------------------//
		
		
		
		//출력하기 위한 배열 정리(방법 2.)
		//-----------------------------------------//
				
		for(int i=0;i<num;i++) {        //원래는 행 ->  열로 사용
			for(int j=0;j<num;j++) {    //원래는 열 ->  행으로 사용
				array[j][i]=i*num+j+1; 
			}
		}
		//-----------------------------------------//
		
		System.out.println();
		
		//출력
		//-----------------------------------------//
		for(int i=0;i<num;i++) {
			for(int j=0;j<num;j++) {
				System.out.printf("%3d",array[i][j]);   //보기 좋게 정렬
			}
			System.out.println();
		}
		//-----------------------------------------//
	}

}
